Autodesk.Revit.DB.Structure.ReinforcementNumberingMethod
Defines numbering method settings.
Since:
2026

Autodesk.Revit.DB.Structure.ReinforcementNumberingMethod.MatchSetsWithIdenticalBars
If this value is Match Sets With Identical Bars, the following happens:
1. The Revit numbering mechanism (Autodesk.Revit.DB.NumberingSchema)
will assign the same number for Rebar sets with varying length bars if bars at the same index are identical even if these bars are moved.2. Each bar within a set with varying length bars will also be assigned a suffix parameter (REBAR_NUMBER_SUFFIX).
This suffix parameter will receive values based on the RebarVaryingLengthNumberSuffix property.

Autodesk.Revit.DB.Structure.ReinforcementNumberingMethod.AssignUniqueNumberPerSet
If this value is Assign Unique Numbers Per Set, the following happens:
1. The Revit numbering mechanism (Autodesk.Revit.DB.NumberingSchema)
will assign a unique number for each Rebar set which has varying length bars.
Each bar within the varying set will have(share) the same number that was assigned for the entire set.2. Each bar within a set with varying length bars will also be assigned a suffix parameter (REBAR_NUMBER_SUFFIX).
This suffix parameter will receive values based on the RebarVaryingLengthNumberSuffix property.

Autodesk.Revit.DB.Structure.ReinforcementNumberingMethod.NumberBarsIndividually
If this value is Numbers Bars Individually, then the Revit numbering mechanism (Autodesk.Revit.DB.NumberingSchema)
will assign a number to each bar in a rebar set with varying lengths. It will also assign a number to the sets that don't have varying length bars.
The number is assigned based on the Revit numbering logic. (For example if two bars are identical, they will receive the same number).
The numbering mechanism will compare varying bars with other varying or uniform bars within the project. (i.e each bar in a varying set is interpreted as an individual Rebar).
The shape parameters of a Rebar can be accessed via Autodesk::Revit::DB::Structure::RebarShapeDefinition::getParameters method.
The parameters at a specific index in a Rebar set can be accessed via Autodesk::Revit::DB::Structure::Rebar::getParameterValueAtIndex method.